# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSet..::..ForwardIterator Method
DocumentSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual DocumentSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As DocumentSetIterator
```

Visual C++
---
```text
public:
virtual DocumentSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
DocumentSet Class
Autodesk.Revit.DB Namespace